app/Controllers/Auth.php

    public function login()
    {
        $post = $this->request->getPost();
        $datapost = $this->staffmodel->where(['email' => $post['email']])->first();
---
SELECT *
FROM `staff`
WHERE `email` = 'agi@gmail.com'
AND `staff`.`deleted_at` IS NULL
 LIMIT 1