app/Controllers/Book.php

    public function index()
    {
        if(!session('id'))
        {
            return redirect()->to(base_url())->with('error', 'Anda harus Login');
        }

        $data = array(
            'book' => $this->bookmodel
                            ->select('book.id as id,book.title,book.author,book.publication_year,publisher.name,category.category,book.quantity')
                            ->join('publisher', 'book.id_publisher=publisher.id','left')
                            ->join('category', 'book.id_category=category.id','left')
                            ->findAll(),
        );
---
SELECT `book`.`id` as `id`, `book`.`title`, `book`.`author`, `book`.`publication_year`, `publisher`.`name`, `category`.`category`, `book`.`quantity`
FROM `book`
LEFT JOIN `publisher` ON `book`.`id_publisher`=`publisher`.`id`
LEFT JOIN `category` ON `book`.`id_category`=`category`.`id`
WHERE `book`.`deleted_at` IS NULL

    public function edit($id)
    {
        if(!session('id'))
        {
            return redirect()->to(base_url())->with('error','Anda Harus Login');
        }

        $data = array(
            'item' => $this->bookmodel->where(['id' => $id])->first(),
            'id' => $id,
            'publisher' => $this->publishermodel->findAll(),
            'category' => $this->categorymodel->findAll(),
        );
---
SELECT *
FROM `book`
WHERE `id` = '1'
AND `book`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `publisher`
WHERE `publisher`.`deleted_at` IS NULL
SELECT *
FROM `category`
WHERE `category`.`deleted_at` IS NULL