app/Controllers/Borrow.php

SELECT `borrow`.`id` as `id`, `borrower`.`name`, `book`.`title`, `staff`.`name` as `staff`, `borrow`.`release_date`, `borrow`.`due_date`, `borrow`.`note`
FROM `borrow`
LEFT JOIN `borrower` ON `borrow`.`id_borrower`=`borrower`.`id`
LEFT JOIN `book` ON `borrow`.`id_book`=`book`.`id`
LEFT JOIN `staff` ON `borrow`.`id_staff`=`staff`.`id`
WHERE `borrow`.`deleted_at` IS NULL
---
    public function index()
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda harus login');
        }
        $data = array(
            'borrow' => $this->borrowmodel
                ->select('borrow.id as id,borrower.name,book.title,staff.name as staff,borrow.release_date,borrow.due_date,borrow.note')
                ->join('borrower', 'borrow.id_borrower=borrower.id', 'left')
                ->join('book', 'borrow.id_book=book.id', 'left')
                ->join('staff', 'borrow.id_staff=staff.id', 'left')
                ->findAll()
        );

INSERT INTO `borrow` (`id_borrower`, `id_book`, `id_staff`, `release_date`, `due_date`, `note`, `created_at`, `updated_at`) VALUES ('5', '1', '1', '2023-05-12', '2023-05-30', 'peminjaman', '2023-05-17 11:29:44', '2023-05-17 11:29:44')
---
            return redirect()->to('borrow-add')->withInput();
        }

        $this->borrowmodel->save([
            'id_borrower' => $post['id_borrower'],
            'id_book' => $post['id_book'],
            'id_staff' => $post['id_staff'],
            'release_date' => $post['release_date'],
            'due_date' => $post['due_date'],
            'note' => $post['note'],
        ]);