app/Controllers/Borrower.php

    public function index()
    {
        if(!session('id'))
        {
            return redirect()->to(base_url())->with('error', 'Anda Harus Login');
        }
        $data = array(
            'borrower' => $this->borrowermodel->findAll(),
        );
---
SELECT *
FROM `borrower`
WHERE `borrower`.`deleted_at` IS NULL

    public function edit($id)
    {
        if(!session('id'))
        {
            return redirect()->to(base_url())->with('error','Anda Harus Login');
        }
        $data = array(
            'item' => $this->borrowermodel->where(['id'=>$id])->first(),
            'id' => $id,
        );
---
SELECT *
FROM `borrower`
WHERE `id` = '3'
AND `borrower`.`deleted_at` IS NULL
 LIMIT 1

    public function editpro()
    {
        if(!session('id'))
        {
            return redirect()->to(base_url())->with('error','Anda Harus Login');
        }

        $post = $this->request->getPost();
        $datapost = $this->borrowermodel->where(['id' => $post['id']])->first();

        if($post['email'] == $datapost['email'])
        {
            if(!$this->validate([
                'name' => [
                    'rules' => 'required',
                    'errors' => ['required' => 'wajib diisi'],
                ],
            ])){
                $validation = \config\Services::validation();
                session()->setFlashdata('validation',$validation->getErrors());
                return redirect()->to('borrower-add')->withInput();
            }
            $this->borrowermodel->save([
                'id'    => $post['id'],
                'name' => $post['name'],
                'birthdate' => $post['birthdate'],
                'address' => $post['address'],
                'gender' => $post['gender'],
                'contact' => $post['contact'],
                'email' => $post['email']

            ]);
---
SELECT *
FROM `borrower`
WHERE `id` = '3'
AND `borrower`.`deleted_at` IS NULL
 LIMIT 1
UPDATE `borrower` SET `name` = 'ahmad', `birthdate` = '2023-05-13', `address` = 'cimahi', `gender` = 'P', `contact` = '123456', `email` = 'ahmad@gmail.com', `updated_at` = '2023-05-16 12:23:00'
WHERE `borrower`.`id` IN ('3')

    public function del($id)
    {
        if(!session('id'))
        {
            return redirect()->to(base_url())->with('error','Anda Harus Login');
        }

        $delete = $this->borrowermodel->delete($id);
---
UPDATE `borrower` SET `deleted_at` = '2023-05-15 13:03:17', `updated_at` = '2023-05-15 13:03:17'
WHERE `id` IN ('4')
AND `deleted_at` IS NULL