app/Controllers/Category.php

    public function index()
    {
        if(!session('id'))
        {
            return redirect()->to(base_url())->with('error', 'Anda harus Login');
        }

        $data = array(
            'category' => $this->categorymodel->findAll(),
        );
---
SELECT *
FROM `category`
WHERE `category`.`deleted_at` IS NULL

    public function editpro()
    {
        if(!session('id'))
        {
            return redirect()->to(base_url())->with('error','Anda Harus Login');
        }

        $post = $this->request->getPost();
        $datapost = $this->categorymodel->where(['id' => $post['id']])->first();
---
SELECT *
FROM `category`
WHERE `id` = '3'
AND `category`.`deleted_at` IS NULL
 LIMIT 1

                session()->setFlashdata('validation',$validation->getErrors());
                return redirect()->to('category-add')->withInput();
            }
            $this->categorymodel->save([
                'id'    => $post['id'],
                'category' => $post['category'],
            ]);
---
UPDATE `category` SET `category` = 'novel1', `updated_at` = '2023-05-16 12:21:03'
WHERE `category`.`id` IN ('3')