app/Controllers/Home.php

SELECT COUNT(*) AS `numrows` FROM `staff`
SELECT COUNT(*) AS `numrows` FROM `borrower`
SELECT COUNT(*) AS `numrows` FROM `book`
SELECT COUNT(*) AS `numrows` FROM `publisher`
SELECT COUNT(*) AS `numrows` FROM `category`
SELECT COUNT(*) AS `numrows` FROM `borrow`
---
    public function home()
    {
        if(!session('id'))
        {
            return redirect()->to(base_url())->with('error', 'Anda harus Login');
        }

        $data = array(
            'qstaff' => $this->staffmodel->countall(),
            'qborrower' => $this->borrowermodel->countall(),
            'qbook' => $this->bookmodel->countall(),
            'qpublisher' => $this->publishermodel->countall(),
            'qcategory' => $this->categorymodel->countall(),
            'qborrow' => $this->borrowmodel->countall(),


        );