app/Controllers/Staff.php

SELECT *
FROM `staff`
WHERE `staff`.`deleted_at` IS NULL
---
    public function index()
    {
        if(!session('id'))
        {
            return redirect()->to(base_url())->with('error', 'Anda harus Login');
        }

        $data = array(
            'staff' => $this->staffmodel->findAll(),
        );

INSERT INTO `staff` (`name`, `email`, `password`, `created_at`, `updated_at`) VALUES ('user', 'user1@gmail.com', '46f94c8de14fb36680850768ff1b7f2a', '2023-05-12 11:19:02', '2023-05-12 11:19:02')
---
            return redirect()->to('staff-add')->withInput();
        }

            $this->staffmodel->save([
                'name' => $post['name'],
                'email' => $post['email'],
                'password' => md5($post['password']),
            ]);